Final_Case/Refined_Grid/Turbulent/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 136688;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 136688;
    }

    obstical
    {
        type            epsilonWallFunction;
        value           uniform 136688;
    }

    obsticalTop
    {
        type            epsilonWallFunction;
        value           uniform 136688;
    }

    lowerSymmetry
    {
        type            symmetryPlane;
    }

    top 
    {
        type            freestream;
        freestreamValue uniform 136688;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
