Final_Case/Refined_Grid/Turbulent/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          3.375;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inlet
    {
        type            kqRWallFunction;
        value           uniform 3.375;
    }

    obstical
    {
        type            kqRWallFunction;
        value           uniform 3.375;
    }

    obsticalTop
    {
        type            kqRWallFunction;
        value           uniform 3.375;
    }

    lowerSymmetry
    {
        type            symmetryPlane;
    }

    top 
    {
        type            freestream;
        freestreamValue uniform 3.375;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
