Final_Case/Refined_Grid/Turbulent/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet         40500;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 40500;
    }

    obstical
    {
        type            omegaWallFunction;
        value           uniform 40500;
    }

    lowerSymmetry
    {
        type            symmetryPlane;
    }

    top 
    {
        type            freestream;
        freestreamValue uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************ //
