Final_Case/Refined_Grid/Turbulent/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    obstical
    {
        type            zeroGradient;
    }

    obsticalTop
    {
        type            zeroGradient;
    }

    top
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
	
    lowerSymmetry
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
