Final_Case/Refined_Grid/Turbulent/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          173;
        startFace       24588;
    }
    outlet
    {
        type            patch;
        nFaces          173;
        startFace       24761;
    }
    lowerSymmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          57;
        startFace       24934;
    }
    obstical
    {
        type            wall;
        inGroups        1(wall);
        nFaces          88;
        startFace       24991;
    }
    obsticalTop
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       25079;
    }
    top
    {
        type            patch;
        nFaces          77;
        startFace       25099;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24882;
        startFace       25176;
    }
)

// ************************************************************************* //
