Final_Case/Refined_Grid/Turbulent/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                           |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox     |
|  \\    /   O peration     | Version:  v1912                           |
|   \\  /    A nd           | Website:  www.openfoam.com                |
|    \\/     M anipulation  |                                           |
\*---------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

method          simple;

coeffs
{
    n           (4 1 1);
}

distributed     no;

// ******************************************************************* //
